app/views/things/index.html.erb

SELECT "things".* FROM "things"
---
    <div class="card">
      <%= image_tag thing.thing_images.first, {:class => "card-img-top"} %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <p class="card-text"><%= thing.description %></p>
        <p class="card-text"><small class="text-muted"><%= @users.find(thing.owner.id).username %></small></p>

SELECT "tags".id FROM "tags" INNER JOIN "tags_things" ON "tags"."id" = "tags_things"."tag_id" WHERE "tags_things"."thing_id" = $1  [["thing_id", 1]]
---

        <td><% thing.tag_ids.each do |tag| %>