app/views/things/show.html.erb

  <strong>Category:</strong>
  <% @thing.tag_ids.each do |tag| %>
---
SELECT "tags".id FROM "tags" INNER JOIN "tags_things" ON "tags"."id" = "tags_things"."tag_id" WHERE "tags_things"."thing_id" = $1  [["thing_id", 1]]