app/views/tag/show.html.erb

SELECT  "things".* FROM "things" INNER JOIN "tags_things" ON "things"."id" = "tags_things"."thing_id" WHERE "tags_things"."tag_id" = $1 ORDER BY "things"."id" ASC LIMIT $2  [["tag_id", 1], ["LIMIT", 1]]
---
<ul>
  <% @tag.things.each do |thing| %>