app/controllers/images_controller.rb

  def create
    add_more_images(image_params[:thing_images])
    flash[:error] = "Failed uploading images" unless @thing.save
---
UPDATE "things" SET "thing_images" = $1, "updated_at" = $2 WHERE "things"."id" = $3  [["thing_images", "{jlawnmower.jpg,ladder.jpg,baseball-bat.jpg}"], ["updated_at", 2016-08-07 13:08:06 UTC], ["id", 2]]

  def destroy
    remove_image_at_index(params[:id].to_i)
    flash[:error] = "Failed to Delete image" unless @thing.save
---
UPDATE "things" SET "thing_images" = $1, "updated_at" = $2 WHERE "things"."id" = $3  [["thing_images", "{jlawnmower.jpg,baseball-bat.jpg}"], ["updated_at", 2016-08-07 13:50:34 UTC], ["id", 2]]

    def set_thing
      @thing = Thing.find(params[:thing_id])
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]