app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]
UPDATE "messages" SET "read" = 't' WHERE "messages"."conversation_id" = $1 AND (user_id != 2 AND read = 'f')  [["conversation_id", 1]]
---
  def index
    @messages = @conversation.messages

    @messages.where("user_id != ? AND read = ?", current_user.id, false).update_all(read: true)

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Can I borrow your lawnmower?"], ["conversation_id", 1], ["user_id", 2], ["created_at", 2016-08-09 10:06:48 UTC], ["updated_at", 2016-08-09 10:06:48 UTC]]
---
  def create
    @message = @conversation.messages.new(message_params)
    @message.user = current_user

    if @message.save