app/controllers/tag_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "things".* FROM "things" WHERE "things"."tag_id" = $1  [["tag_id", "1"]]
---
  def show
    @tag = Tag.find(params[:id])
    @things = Things.find