app/controllers/things_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @thing = Thing.find(params[:id])
    @owner = @thing.owner_id
    @owners= User.find_by(id: @owner)