app/controllers/things_controller.rb

  def yourthings
    @things = Thing.where(:user_id => current_user.id)
---
SELECT "things".* FROM "things" WHERE "things"."user_id" = $1  [["user_id", 1]]

  def index
    @tags = Tag.all
    @things = Thing.all
---
SELECT "tags".* FROM "tags"
SELECT "things".* FROM "things"

  def show
    @tags = Tag.all
    @thing = Thing.find(params[:id])
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @tags= Tag.all
---
SELECT "tags".* FROM "tags"

  def edit
    if current_user.id == @thing.user_id
      @tags= Tag.all
      @thing = Thing.find(params[:id])
---
SELECT "tags".* FROM "tags"
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create

    @thing = Thing.new(thing_params)
    @thing.user_id = current_user.id
    respond_to do |format|
      if @thing.save
---
INSERT INTO "tags_things" ("tag_id", "thing_id") VALUES ($1, $2)  [["tag_id", 1], ["thing_id", 2]]
INSERT INTO "things" ("thing_image", "title", "description", "owner_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["thing_image", "lekbnd"], ["title", "3rd"], ["description", "desription"], ["owner_id", ""], ["user_id", 1], ["created_at", 2016-08-06 14:31:51 UTC], ["updated_at", 2016-08-06 14:31:51 UTC]]

  def update

    image_array = @thing.thing_images

    if params[:images_to_delete]
      params[:images_to_delete].each do |index|
        deleted_image = image_array.delete_at(index.to_i)
        deleted_image.try(:remove!)
      end
    end

    if params[:thing][:thing_images].present?
      image_array += params[:thing][:thing_images]
    end

    @thing.thing_images = image_array

    respond_to do |format|
      if @thing.update(thing_params)
---
UPDATE "things" SET "thing_images" = $1, "updated_at" = $2 WHERE "things"."id" = $3  [["thing_images", "{#<ActionDispatch::Http::UploadedFile:0x007f83ea048498>,#<ActionDispatch::Http::UploadedFile:0x007f83ea048470>}"], ["updated_at", 2016-08-07 11:30:00 UTC], ["id", 1]]

  def destroy
    @thing = Thing.find(params[:id])
    puts @thing.id.to_s + ": The :id of the thing"

    @thing.destroy
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tags_things" WHERE "tags_things"."thing_id" = $1  [["thing_id", 1]]
DELETE FROM "things" WHERE "things"."id" = $1  [["id", 1]]

    def set_thing
      @thing = Thing.find(params[:id])
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]