app/controllers/user_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."username" ASC
---
  def index
    @users = User.all.order(:username)